aaron-bond.better-comments
alefragnani.bookmarks
charliermarsh.ruff
davidanson.vscode-markdownlint
fisheva.eva-theme
jeff-hykin.better-dockerfile-syntax
johnpapa.vscode-peacock
mads-hartmann.bash-ide-vscode
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
njpwerner.autodocstring
pkief.material-icon-theme
shd101wyy.markdown-preview-enhanced
stephanoskomnenos.jieba
tamasfe.even-better-toml
usernamehw.errorlens
vscodevim.vim
yzhang.markdown-all-in-one
